{
  "pipeline_name": "Experiment_B_NEQR",
  "pipeline_slug": "Experiment_B_NEQR",
  "run_dir": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35",
  "started_at": "2026-05-04T12:35:31",
  "completed_at": "2026-05-04T15:55:50",
  "subsets": [
    {
      "subset_index": 1,
      "subset_count": 5,
      "report_context": {
        "title": "EXPERIMENTAL PROTOCOL REPORT",
        "dataset_name": "MNIST digits stratified",
        "classifier_name": "NEQR + QNN + Dense",
        "model_architecture": "GEQIE/NEQR-encoded circuits -> VQCLayer(num_qubits, num_layers) -> Linear(2**num_qubits, num_classes) -> LogSoftmax",
        "subset_name": "1/5",
        "split_sizes": {
          "train": 921,
          "val": 231,
          "test": 288
        },
        "training_setup": {
          "epochs": 10,
          "batch_size": 16,
          "device": "cpu",
          "qnn_lr": 0.001,
          "head_lr": 0.01
        },
        "model_setup": {
          "num_classes": 10,
          "num_qubits": 9,
          "num_layers": 1
        }
      },
      "model": {
        "class_name": "Sequential",
        "module": "torch.nn.modules.container",
        "repr": "Sequential(\n  (0): VQCLayer(num_qubits=9, num_layers=1, shots=1024, scale_output=True, num_params=27)\n  (1): Linear(in_features=512, out_features=10, bias=True)\n  (2): LogSoftmax(dim=-1)\n)"
      },
      "files": {
        "report": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_01_report.log",
        "epochs": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_01_epochs.csv",
        "test_metrics": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_01_test_metrics.csv",
        "confusion_matrix_csv": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_01_confusion_matrix.csv",
        "confusion_matrix_txt": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_01_confusion_matrix.txt",
        "best_model": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_01_best_model.pt",
        "best_model_metadata": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_01_best_model_meta.json"
      }
    },
    {
      "subset_index": 2,
      "subset_count": 5,
      "report_context": {
        "title": "EXPERIMENTAL PROTOCOL REPORT",
        "dataset_name": "MNIST digits stratified",
        "classifier_name": "NEQR + QNN + Dense",
        "model_architecture": null,
        "subset_name": "2/5",
        "split_sizes": {
          "train": 921,
          "val": 231,
          "test": 288
        },
        "training_setup": {
          "epochs": 10,
          "batch_size": 16,
          "device": "cpu",
          "qnn_lr": 0.001,
          "head_lr": 0.01
        },
        "model_setup": {
          "num_classes": 10,
          "num_qubits": 9,
          "num_layers": 1
        }
      },
      "model": {
        "class_name": "Sequential",
        "module": "torch.nn.modules.container",
        "repr": "Sequential(\n  (0): VQCLayer(num_qubits=9, num_layers=1, shots=1024, scale_output=True, num_params=27)\n  (1): Linear(in_features=512, out_features=10, bias=True)\n  (2): LogSoftmax(dim=-1)\n)"
      },
      "files": {
        "report": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_02_report.log",
        "epochs": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_02_epochs.csv",
        "test_metrics": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_02_test_metrics.csv",
        "confusion_matrix_csv": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_02_confusion_matrix.csv",
        "confusion_matrix_txt": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_02_confusion_matrix.txt",
        "best_model": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_02_best_model.pt",
        "best_model_metadata": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_02_best_model_meta.json"
      }
    },
    {
      "subset_index": 3,
      "subset_count": 5,
      "report_context": {
        "title": "EXPERIMENTAL PROTOCOL REPORT",
        "dataset_name": "MNIST digits stratified",
        "classifier_name": "NEQR + QNN + Dense",
        "model_architecture": null,
        "subset_name": "3/5",
        "split_sizes": {
          "train": 921,
          "val": 231,
          "test": 288
        },
        "training_setup": {
          "epochs": 10,
          "batch_size": 16,
          "device": "cpu",
          "qnn_lr": 0.001,
          "head_lr": 0.01
        },
        "model_setup": {
          "num_classes": 10,
          "num_qubits": 9,
          "num_layers": 1
        }
      },
      "model": {
        "class_name": "Sequential",
        "module": "torch.nn.modules.container",
        "repr": "Sequential(\n  (0): VQCLayer(num_qubits=9, num_layers=1, shots=1024, scale_output=True, num_params=27)\n  (1): Linear(in_features=512, out_features=10, bias=True)\n  (2): LogSoftmax(dim=-1)\n)"
      },
      "files": {
        "report": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_03_report.log",
        "epochs": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_03_epochs.csv",
        "test_metrics": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_03_test_metrics.csv",
        "confusion_matrix_csv": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_03_confusion_matrix.csv",
        "confusion_matrix_txt": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_03_confusion_matrix.txt",
        "best_model": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_03_best_model.pt",
        "best_model_metadata": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_03_best_model_meta.json"
      }
    },
    {
      "subset_index": 4,
      "subset_count": 5,
      "report_context": {
        "title": "EXPERIMENTAL PROTOCOL REPORT",
        "dataset_name": "MNIST digits stratified",
        "classifier_name": "NEQR + QNN + Dense",
        "model_architecture": null,
        "subset_name": "4/5",
        "split_sizes": {
          "train": 921,
          "val": 231,
          "test": 288
        },
        "training_setup": {
          "epochs": 10,
          "batch_size": 16,
          "device": "cpu",
          "qnn_lr": 0.001,
          "head_lr": 0.01
        },
        "model_setup": {
          "num_classes": 10,
          "num_qubits": 9,
          "num_layers": 1
        }
      },
      "model": {
        "class_name": "Sequential",
        "module": "torch.nn.modules.container",
        "repr": "Sequential(\n  (0): VQCLayer(num_qubits=9, num_layers=1, shots=1024, scale_output=True, num_params=27)\n  (1): Linear(in_features=512, out_features=10, bias=True)\n  (2): LogSoftmax(dim=-1)\n)"
      },
      "files": {
        "report": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_04_report.log",
        "epochs": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_04_epochs.csv",
        "test_metrics": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_04_test_metrics.csv",
        "confusion_matrix_csv": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_04_confusion_matrix.csv",
        "confusion_matrix_txt": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_04_confusion_matrix.txt",
        "best_model": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_04_best_model.pt",
        "best_model_metadata": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_04_best_model_meta.json"
      }
    },
    {
      "subset_index": 5,
      "subset_count": 5,
      "report_context": {
        "title": "EXPERIMENTAL PROTOCOL REPORT",
        "dataset_name": "MNIST digits stratified",
        "classifier_name": "NEQR + QNN + Dense",
        "model_architecture": null,
        "subset_name": "5/5",
        "split_sizes": {
          "train": 921,
          "val": 231,
          "test": 288
        },
        "training_setup": {
          "epochs": 10,
          "batch_size": 16,
          "device": "cpu",
          "qnn_lr": 0.001,
          "head_lr": 0.01
        },
        "model_setup": {
          "num_classes": 10,
          "num_qubits": 9,
          "num_layers": 1
        }
      },
      "model": {
        "class_name": "Sequential",
        "module": "torch.nn.modules.container",
        "repr": "Sequential(\n  (0): VQCLayer(num_qubits=9, num_layers=1, shots=1024, scale_output=True, num_params=27)\n  (1): Linear(in_features=512, out_features=10, bias=True)\n  (2): LogSoftmax(dim=-1)\n)"
      },
      "files": {
        "report": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_05_report.log",
        "epochs": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_05_epochs.csv",
        "test_metrics": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_05_test_metrics.csv",
        "confusion_matrix_csv": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_05_confusion_matrix.csv",
        "confusion_matrix_txt": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_05_confusion_matrix.txt",
        "best_model": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_05_best_model.pt",
        "best_model_metadata": "/home/ODM/mkordasz/geqie/experiments/QNN_integration/results/Experiment_B_NEQR/04-05-2026-12-35/subset_05_best_model_meta.json"
      }
    }
  ]
}