{
  "pipeline_name": "Experiment_D_FRQI_QCNN_QNN_compression",
  "pipeline_slug": "Experiment_D_FRQI_QCNN_QNN_compression",
  "subset_index": 1,
  "subset_count": 5,
  "saved_at": "2026-05-17T04:58:06",
  "model": {
    "class_name": "Sequential",
    "module": "torch.nn.modules.container",
    "repr": "Sequential(\n  (0): VQCLayer(num_qubits=9, num_layers=1, output_qubits=3, shots=1024, scale_output=True, num_params=172)\n  (1): Linear(in_features=512, out_features=10, bias=True)\n  (2): LogSoftmax(dim=-1)\n)"
  },
  "torchinfo_summary": "=================================================================\nLayer (type:depth-idx)                   Param #\n=================================================================\nSequential                               --\n├─VQCLayer: 1-1                          172\n├─Linear: 1-2                            5,130\n├─LogSoftmax: 1-3                        --\n=================================================================\nTotal params: 5,302\nTrainable params: 5,302\nNon-trainable params: 0\n=================================================================",
  "report_context": {
    "title": "EXPERIMENTAL PROTOCOL REPORT",
    "dataset_name": "MNIST digits stratified",
    "classifier_name": "FRQI + QCNN + QNN_compression_layer + Dense",
    "model_architecture": "GEQIE/FRQI-encoded circuits -> VQCLayer(num_qubits, num_layers=1, ansatz_factory=build_adaptive_qcnn_ansatz) -> Linear(2**num_qubits, num_classes) -> LogSoftmax",
    "subset_name": "1/5",
    "split_sizes": {
      "train": 921,
      "val": 231,
      "test": 288
    },
    "training_setup": {
      "epochs": 50,
      "batch_size": 16,
      "device": "cpu",
      "qnn_lr": 0.001,
      "head_lr": 0.01
    },
    "model_setup": {
      "num_classes": 10,
      "num_qubits": 9,
      "num_layers": 1
    },
    "torchinfo_summary": "=================================================================\nLayer (type:depth-idx)                   Param #\n=================================================================\nSequential                               --\n├─VQCLayer: 1-1                          172\n├─Linear: 1-2                            5,130\n├─LogSoftmax: 1-3                        --\n=================================================================\nTotal params: 5,302\nTrainable params: 5,302\nNon-trainable params: 0\n================================================================="
  }
}